### Задание 1

In [84]:
import numpy as np

In [85]:
import pandas as pd

In [86]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [87]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]})
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [88]:
authors_price = pd.merge(authors, books, on="author_id", how="inner")
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [89]:
top5 = authors_price.sort_values(by="price", ascending=False).head(5)
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание 4

In [90]:
authors_stat=authors_price.groupby('author_name').agg({'price':'min'})
authors_stat=authors_stat.rename(columns={'price':'min_price'})
authors_stat=pd.concat([authors_stat, authors_price.groupby('author_name').agg({'price':'max'})], axis=1)
authors_stat=authors_stat.rename(columns={'price':'max_price'})
authors_stat=pd.concat([authors_stat, authors_price.groupby('author_name').agg({'price':'mean'})], axis=1)
authors_stat=authors_stat.rename(columns={'price':'mean_price'})
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

### Задание 5

In [91]:
authors_price=pd.concat([authors_price, pd.DataFrame({'cover':['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})], axis=1)
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [93]:
book_info=authors_price.pivot_table(index='author_name', columns='cover',aggfunc={'price':'mean'}).fillna(0)

book_info

             price
cover       мягкая твердая
author_name
Островский   330.0     0.0
Тургенев     325.0   450.0
Чехов          0.0   475.0

In [95]:
book_info.to_pickle('book_info.pkl')
book_info2=pd.read_pickle('book_info.pkl')

In [98]:
book_info.equals(book_info2)

True